# define.py
# Network
BUF_SIZE = 10240
SERVER_HOST = '1.241.29.227'
SERVER_PORT = 12345

# Screen dimensions (FHD)
BASE_SCREEN_WIDTH = 1600
BASE_SCREEN_HEIGHT = 900

# Scale factor for initial window
INITIAL_SCALE = 0.95

# Grid
GRID_COLUMNS = 10
GRID_ROWS = 20
CELL_SIZE = 35 # 리소스에서 로드하려면 기본적인 값이 필요해서 값 유지

# FPS
FPS = 60

# Tetromino shapes and colors
SHAPES = {
    'I': [
        [(0,1), (1,1), (2,1), (3,1)],        # rot 0
        [(2,0), (2,1), (2,2), (2,3)],        # rot 1
    ],

    'J': [
        [(0,0), (0,1), (1,1), (2,1)],        # rot 0
        [(1,0), (2,0), (1,1), (1,2)],        # rot 1
        [(0,1), (1,1), (2,1), (2,2)],        # rot 2
        [(1,0), (1,1), (0,2), (1,2)],        # rot 3
    ],

    'L': [
        [(2,0), (0,1), (1,1), (2,1)],        # rot 0
        [(1,0), (1,1), (1,2), (2,2)],        # rot 1
        [(0,1), (1,1), (2,1), (0,2)],        # rot 2
        [(0,0), (1,0), (1,1), (1,2)],        # rot 3
    ],

    'O': [
        [(1,0), (2,0), (1,1), (2,1)],        # rot 0 only
    ],

    'S': [
        [(1,1), (2,1), (0,2), (1,2)],        # rot 0
        [(1,0), (1,1), (2,1), (2,2)],        # rot 1
    ],

    'T': [
        [(1,0), (0,1), (1,1), (2,1)],        # rot 0
        [(1,0), (1,1), (2,1), (1,2)],        # rot 1
        [(0,1), (1,1), (2,1), (1,2)],        # rot 2
        [(1,0), (0,1), (1,1), (1,2)],        # rot 3
    ],

    'Z': [
        [(0,1), (1,1), (1,2), (2,2)],        # rot 0
        [(2,0), (1,1), (2,1), (1,2)],        # rot 1
    ],
}


SHAPES_INDEX = {
     0 : 'I',
     1 : 'J',
     2 : 'L',
     3 : 'O',
     4 : 'S',
     5 : 'T',
     6 : 'Z',
     7 : 'G'
}
